In [29]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [30]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

Program 1

In [ ]:
for i in range(len(df['FlightNumber'])):
  df['FlightNumber'][i] = df['FlightNumber'][0]+10*i
df.FlightNumber = df.FlightNumber.astype('int64')

In [32]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

Program 2

In [36]:
index=[]
indec=[]
for i in df.From_To:
  count=-1
  for k in i:
    count+=1
    if k=='_':
      index.append(i[:count])
      indec.append(i[count+1:])
      break
  
dat = {'From':index,'To':indec}
temp_df = pd.DataFrame(data = dat)

In [ ]:
temp_df

Program 3

In [41]:
for i in range(len(temp_df)):
  temp_df['From'][i] = temp_df['From'][i].title()
  temp_df['To'][i] = temp_df['To'][i].title()

In [42]:
temp_df

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

Program 4

In [43]:
df['From'] = temp_df['From']
df['To'] = temp_df['To']
df.drop(columns = 'From_To')

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

Program 5

In [44]:
lent =[]
for rows in range(len(df['RecentDelays'])):
  lent.append(len(df['RecentDelays'][rows]))
col_length = max(lent)
columns =[]
for i in range(col_length):
  #print("i = ", i)
  for j in range(len(df['RecentDelays'])):
    #print(i,j,len(df['RecentDelays'][j]))
    if i<len(df['RecentDelays'][j]):
      #print(df['RecentDelays'][j][i])
      columns.append(df['RecentDelays'][j][i])
    else:
      #print('NaN')
      columns.append('NaN')
  df['delay'+ "_" +str(i+1)] = columns
  columns=[]
df.drop(columns = 'RecentDelays')

            From_To  FlightNumber              Airline  ... delay_1 delay_2 delay_3
0      LoNDon_paris         10045               KLM(!)  ...      23      47     NaN
1      MAdrid_miLAN         10055    <Air France> (12)  ...     NaN     NaN     NaN
2  londON_StockhOlm         10065  (British Airways. )  ...      24      43      87
3    Budapest_PaRis         10075       12. Air France  ...      13     NaN     NaN
4   Brussels_londOn         10085          "Swiss Air"  ...      67      32     NaN

[5 rows x 8 columns]